# C(n, 0) = 1
# Eсли k > n, то C(n, k) = 0
# Для вычисления C(n, k) в других случаях используется следующая рекуррентная формула:
# C(n, k) = C(n - 1, k) + C(n - 1, k - 1).
# Реализуйте программу, которая для заданных n и k вычисляет C(n, k).
# Вашей программе на вход подается строка, содержащая два целых числа n и k (1 ≤ n ≤ 10, 0 ≤ k ≤ 10).
# Ваша программа должна вывести единственное число: C(n, k).
#
def Comb(n, k):         # Определение функции
    if k == 0:          # Граница, конечный результат в стеке
        return 1
    if k == n:          # Исключаем из рекурсии для сокращения действий
        return 1
    if k > n:           # Граница, конечный результат в стеке
        return 0
    Res = Comb(n - 1, k) + Comb(n - 1, k - 1)   # Собственно формула
    return Res
n, k = map(int, input().split())
print("n:", n, "k:", k)
Y = Comb(n, k)
print(Y)