# Напишите программу, которая запускается из консоли и печатает значения всех переданных
# аргументов на экран (имя скрипта выводить не нужно). Не изменяйте порядок аргументов при выводе.
# Для доступа к аргументам командной строки программы подключите модуль sys и используйте
# переменную argv из этого модуля.
#
# import sys
from sys import argv
# argv
# print(len(argv))
# print(argv)
for i in range(1, 3):
    print(argv)
