# Напишите программу, которая запускается из консоли и печатает значения всех переданных
# аргументов на экран (имя скрипта выводить не нужно). Не изменяйте порядок аргументов при выводе.
# Для доступа к аргументам командной строки программы подключите модуль sys и используйте
# переменную argv из этого модуля.
#
from sys import argv        # Импорт функции argv из модуля sys
Length = len(argv)          # Определение числа аргументов
if Length > 1:              # Если есть аргументы кроме вызова Python
    for i in range(1, Length):      # Цикл, начиная с индекса 1 (кроме вызова Python)
        print(str(argv[i]))
else:
    print("Arguments not provided!")    # Вызов Python без параметров