# В команде биологов aa человек, а в команде информатиков — bb человек.
# каждому участнику этой команды должно достаться одинаковое число кусочков пирога.
# И так как не хочется резать пирог на слишком мелкие кусочки, нужно найти минимальное подходящее число.
# Программа должна считывать размеры команд (два положительных целых числа a и b,
# каждое число вводится на отдельной строке) и выводить наименьшее число d, которое делится
# на оба этих числа без остатка.
#
# print("Input A")
A = int(input())
#print("Input B")
B = int(input())
# print(A)
# print(B)
if A >= B:
    Result = A
else:
    Result = B
N = Result
# print(N)
while N != 0:
    Rest_A = N % A
    Rest_B = N % B
#    print(Rest_A, Rest_B)
    if Rest_A != 0 or Rest_B != 0:
        N = N + 1
    if Rest_A == 0 and Rest_B == 0:
        Result = N
        N = 0
 #   print(N)
print(Result)
